Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_83-The_Questions_of_Bhadrapala_the_Merchant-v1.tmx
Source language: bo
Languages: en

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: This text was translated, edited, and finalized by the Indian scholars Jinamitra and Surendrabodhi, together with the chief editor and translator, the monk Yeshé Dé.
